info_students = [
    (1, 'Алексей', 'Сидоров', 'Юрьевич', '19.04.2005', 'Да', 'Тургеневская, 10', 'ИС'),
    (2, 'Михаил', 'Фомин', 'Юрьевич', '20.01.2004', 'Нет', 'Тургеневская, 39', 'ИКС'),
    (3, 'Мария', 'Андреева', 'Дмитриевна', '07.12.2005', 'Да', 'Тургеневская, 60', 'ИС'),
    (4, 'Александр', 'Баранов', 'Максимович', '28.01.2006', 'Да', 'Тургеневская, 19', 'ИС'),
    (5, 'Сергей', 'Кузнецов', 'Сергеевич', '25.07.2006', 'Нет', 'Тургеневская, 7', 'СА'),
    (6, 'Ксения', 'Краснова', 'Павловна', '18.10.2005', 'Нет', 'Тургеневская, 92', 'ИКС'),
    (7, 'Дарья', 'Новикова', 'Ивановна', '10.09.2006', 'Да', 'Тургеневская, 116', 'СА'),
    (8, 'Константин', 'Зайцев', 'Михайлович', '05.08.2006', 'Да', 'Тургеневская, 120', 'ИС'),
    (9, 'Мария', 'Краснова', 'Георгиевна', '01.09.2006', 'Да', 'Тургеневская, 5', 'ИКС'),
    (10, 'Вера', 'Орлова', 'Алексеевна', '23.03.2005', 'Нет', 'Тургеневская, 9', 'СА')
]